%====================================================
% Матрица със стойности - 16.06.2014
%====================================================
% Час| Минута |DC_Voltage[V]| DC_Current[A]|
%  1 |    2   |       3     |       4      |     

%Data = [7,16,24.3417000000000,0.265100000000000;7,17,24.3156000000000,0.265100000000000;7,18,24.3254000000000,0.265100000000000;7,19,24.3112000000000,0.265100000000000;7,21,24.3069000000000,0.265100000000000;7,22,24.3069000000000,0.265100000000000;7,23,24.3069000000000,0.265100000000000;7,24,24.3069000000000,0.265100000000000;7,25,24.3069000000000,0.265100000000000;7,26,27.3658000000000,43.6340000000000;7,27,27.5498000000000,42.5147000000000;7,28,27.5095000000000,41.0162000000000;7,29,27.4202000000000,38.2069000000000;7,30,27.4148000000000,37.0214000000000;7,31,27.5215000000000,39.1716000000000;7,33,27.5596000000000,39.4219000000000;7,34,27.5357000000000,37.9823000000000;7,35,27.4899000000000,36.3918000000000;7,36,27.5868000000000,37.6988000000000;7,37,27.5803000000000,37.1613000000000;7,38,27.5084000000000,35.2246000000000;7,39,27.5814000000000,35.5228000000000;7,40,27.6794000000000,37.0066000000000;7,41,27.6369000000000,35.5376000000000;7,42,27.5237000000000,32.5221000000000;7,43,27.7110000000000,35.7842000000000;7,45,27.6522000000000,34.1753000000000;7,46,27.6250000000000,33.1443000000000;7,47,27.5596000000000,30.5854000000000;7,48,27.7447000000000,33.7334000000000;7,49,27.7578000000000,33.6635000000000;7,50,27.6097000000000,30.6627000000000;7,51,27.6391000000000,29.6281000000000;7,52,27.7480000000000,32.3564000000000;7,53,27.8210000000000,32.9750000000000;7,54,27.6990000000000,30.3240000000000;7,55,27.7088000000000,29.4219000000000;7,57,27.6979000000000,28.6635000000000;7,58,27.7818000000000,30.0626000000000;7,59,27.7001000000000,28.0891000000000;8,0,27.7349000000000,27.9308000000000;8,1,27.7349000000000,27.1465000000000;8,2,27.8330000000000,28.9249000000000;8,3,27.8068000000000,28.3837000000000;8,4,27.7349000000000,26.0677000000000;8,5,27.7720000000000,26.2776000000000;8,6,27.8460000000000,27.5626000000000;8,7,27.8395000000000,26.9809000000000;8,9,27.7589000000000,24.4035000000000;8,10,27.7404000000000,23.9433000000000;8,11,27.9212000000000,27.3859000000000;8,12,27.8351000000000,25.0221000000000;8,13,27.8253000000000,24.3446000000000;8,14,27.8406000000000,24.0353000000000;8,15,27.9114000000000,25.0736000000000;8,16,27.9429000000000,25.5339000000000;8,17,27.7883000000000,21.5501000000000;8,18,27.8765000000000,22.7872000000000;8,19,27.8972000000000,22.9713000000000;8,21,27.9473000000000,23.7702000000000;8,22,27.8972000000000,22.0876000000000;8,23,27.8624000000000,21.1892000000000;8,24,27.8972000000000,21.4323000000000;8,25,27.9495000000000,22.7835000000000;8,26,27.9048000000000,21.0346000000000;8,27,27.8580000000000,19.4698000000000;8,28,27.9310000000000,20.4971000000000;8,29,28.0409000000000,22.5773000000000;8,30,27.9604000000000,20.6664000000000;8,31,27.8994000000000,18.5125000000000;8,33,27.9854000000000,19.9595000000000;8,34,28.0442000000000,21.1303000000000;8,35,27.9909000000000,19.5545000000000;8,36,27.8841000000000,16.7968000000000;8,37,27.9952000000000,18.4352000000000;8,38,28.0801000000000,20.3535000000000;8,39,27.9843000000000,18.5457000000000;8,40,27.8907000000000,15.9647000000000;8,41,27.9952000000000,17.4595000000000;8,42,28.0703000000000,18.9764000000000;8,44,27.9876000000000,17.3454000000000;8,45,27.9658000000000,15.9241000000000;8,46,27.9440000000000,15.1325000000000;8,47,28.0703000000000,17.4890000000000;8,48,28.0486000000000,16.6421000000000;8,49,28.0453000000000,15.3682000000000;8,50,28.0279000000000,15.1031000000000;8,51,28.0987000000000,16.3328000000000;8,52,28.1030000000000,16.6863000000000;8,53,28.0126000000000,14.1900000000000;8,54,28.0627000000000,14.4109000000000;8,56,28.0475000000000,14.3557000000000;8,57,28.0660000000000,15.0626000000000;8,58,28.0497000000000,13.2732000000000;8,59,28.0758000000000,13.5236000000000;9,0,28.1117000000000,13.8623000000000;9,1,28.1313000000000,14.1421000000000;9,2,28.0649000000000,11.9624000000000;9,3,28.0758000000000,11.8262000000000;9,4,28.1455000000000,13.2806000000000;9,5,28.1564000000000,13.3763000000000;9,6,28.0736000000000,11.6200000000000;9,8,28.0758000000000,11.0052000000000;9,9,28.1629000000000,11.6937000000000;9,10,28.1575000000000,12.2533000000000;9,11,28.1172000000000,10.8468000000000;9,12,28.1052000000000,10.2688000000000;9,13,28.1542000000000,10.6001000000000;9,14,28.2315000000000,11.6532000000000;9,15,28.1488000000000,11.0383000000000;9,16,28.1172000000000,9.97790000000000;9,17,28.1041000000000,8.78500000000000;9,18,28.2163000000000,9.73490000000000;9,20,28.2380000000000,10.9131000000000;9,21,28.2566000000000,10.4602000000000;9,22,28.1400000000000,7.77610000000000;9,23,28.2718000000000,9.91160000000000;9,24,28.3143000000000,10.3240000000000;9,25,28.1901000000000,8.78870000000000;9,26,28.2108000000000,8.28420000000000;9,27,28.2217000000000,7.31590000000000;9,28,28.1792000000000,8.00810000000000;9,29,28.3023000000000,8.75180000000000;9,30,28.2370000000000,7.47050000000000;9,32,28.3361000000000,8.58250000000000;9,33,28.1673000000000,6.86670000000000;9,34,28.2522000000000,5.82470000000000;9,35,28.2587000000000,5.53020000000000;9,36,28.2261000000000,6.66050000000000;9,37,28.2228000000000,7.77610000000000;9,38,28.2566000000000,7.57360000000000;9,39,28.1760000000000,6.41380000000000;9,40,28.2566000000000,4.89690000000000;9,41,28.2402000000000,6.20030000000000;9,42,28.3361000000000,7.69880000000000;9,44,28.3687000000000,5.84320000000000;9,45,28.1096000000000,4.68700000000000;9,46,28.2021000000000,7.10970000000000;9,47,28.4504000000000,7.55520000000000;9,48,28.4929000000000,6.43230000000000;9,49,28.0878000000000,4.42930000000000;9,50,28.2065000000000,4.32250000000000;9,51,28.1498000000000,5.37550000000000;9,52,28.3404000000000,7.48160000000000;9,53,28.5146000000000,6.02720000000000;9,54,28.5212000000000,6.81520000000000;9,56,28.4090000000000,7.08390000000000;9,57,28.1400000000000,3.58620000000000;9,58,28.4580000000000,3.36520000000000;9,59,28.4036000000000,3.78870000000000;10,0,28.2043000000000,3.89910000000000;10,1,28.3426000000000,3.04120000000000;10,2,28.4341000000000,6.26660000000000;10,3,28.2631000000000,3.70770000000000;10,4,28.1466000000000,4.38510000000000;10,5,28.2468000000000,2.16130000000000;10,7,28.0834000000000,2.48160000000000;10,8,28.1313000000000,4.26360000000000;10,9,28.5103000000000,6.84460000000000;10,10,28.2871000000000,1.01620000000000;10,11,28.1771000000000,2.49630000000000;10,12,28.5288000000000,3.09650000000000;10,13,28.3578000000000,2.18700000000000;10,14,28.0910000000000,2.65460000000000;10,15,28.3230000000000,4.72750000000000;10,16,28.1520000000000,3.22900000000000;10,17,28.4243000000000,6.93670000000000;10,19,28.4700000000000,2.28280000000000;10,20,28.3774000000000,5.61860000000000;10,21,28.3829000000000,1.01250000000000;10,22,28.2958000000000,2.82770000000000;10,23,28.2054000000000,1.27020000000000;10,24,28.0616000000000,1.97350000000000;10,25,28.2773000000000,-0.0957000000000000;10,26,28.1281000000000,3.88440000000000;10,27,28.6137000000000,5.31300000000000;10,28,28.3241000000000,2.03240000000000;10,29,28.1782000000000,3.40570000000000;10,31,28.4047000000000,5.61490000000000;10,32,28.3807000000000,5.66640000000000;10,33,28.4526000000000,5.26510000000000;10,34,28.4471000000000,0.349800000000000;10,35,28.3110000000000,-0.143600000000000;10,36,28.1956000000000,3.42420000000000;10,37,28.3763000000000,4.77910000000000;10,38,28.5136000000000,4.69810000000000;10,39,28.2620000000000,1.69370000000000;10,40,28.3774000000000,0.0957000000000000;10,41,28.3676000000000,5.16200000000000;10,43,28.2816000000000,5.23560000000000;10,44,28.6214000000000,4.48450000000000;10,45,28.5854000000000,5.81370000000000;10,46,28.4199000000000,0.228300000000000;10,47,28.4700000000000,3.98380000000000;10,48,28.1520000000000,1.72680000000000;10,49,28.6225000000000,5.57810000000000;10,50,28.2391000000000,1.61630000000000;10,51,28.4330000000000,4.36300000000000;10,52,28.6323000000000,5.15460000000000;10,53,28.2010000000000,3.14060000000000;10,55,28.5811000000000,1.53170000000000;10,56,28.3099000000000,-1.52060000000000;10,57,28.0823000000000,1.29230000000000;10,58,28.2413000000000,1.65320000000000;10,59,28.3034000000000,-0.217200000000000;11,0,28.1379000000000,1.31070000000000;11,1,28.3186000000000,-1.72310000000000;11,2,28.2250000000000,0.0479000000000000;11,3,28.1629000000000,1.49850000000000;11,4,28.5136000000000,-0.0552000000000000;11,5,28.4831000000000,0.681100000000000;11,7,28.5985000000000,2.98600000000000;11,8,28.4711000000000,5.50810000000000;11,9,28.3611000000000,-0.114100000000000;11,10,28.4765000000000,-0.677500000000000;11,11,28.1782000000000,1.20400000000000;11,12,28.3600000000000,4.78640000000000;11,13,28.2380000000000,0.106800000000000;11,14,28.6290000000000,2.55890000000000;11,15,28.6823000000000,2.53680000000000;11,16,28.1607000000000,1.50220000000000;11,17,28.2838000000000,-0.434500000000000;11,19,28.5789000000000,4.03900000000000;11,20,28.6355000000000,3.00070000000000;11,21,28.5495000000000,5.06630000000000;11,22,28.6061000000000,1.69730000000000;11,23,28.1956000000000,2.38590000000000;11,24,28.5800000000000,4.14950000000000;11,25,28.6159000000000,4.06850000000000;11,26,28.1912000000000,-0.180400000000000;11,27,28.1727000000000,-1.10090000000000;11,28,27.8046000000000,-1.13400000000000;11,29,27.3396000000000,0.725300000000000;11,31,27.0228000000000,1.15240000000000;11,32,26.6438000000000,0.0368000000000000;11,33,26.5926000000000,0.408700000000000;11,34,26.5795000000000,0.169400000000000;11,35,26.5904000000000,0.662700000000000;11,36,26.6438000000000,1.56110000000000;11,37,26.5730000000000,0.416100000000000;11,38,26.5795000000000,0.00370000000000000;11,39,26.5817000000000,0.349800000000000;11,40,26.6438000000000,1.43590000000000;11,42,26.5937000000000,0.681100000000000;11,43,26.5850000000000,0.449200000000000;11,44,26.5948000000000,0.684800000000000;11,45,26.6416000000000,1.39540000000000;11,46,26.6394000000000,1.39910000000000;11,47,26.5785000000000,0.382900000000000;11,48,26.6188000000000,0.541200000000000;11,49,26.6242000000000,1.18560000000000;11,50,26.6296000000000,1.27020000000000;11,51,26.5785000000000,0.257700000000000;11,52,26.5589000000000,0.139900000000000;11,54,26.6460000000000,1.53530000000000;11,55,26.6209000000000,1.22240000000000;11,56,26.6133000000000,0.511800000000000;11,57,26.5785000000000,0.173000000000000;11,58,26.6275000000000,1.15980000000000;11,59,26.6340000000000,1.33650000000000;12,0,26.5937000000000,0.695900000000000;12,1,26.6155000000000,0.504400000000000;12,2,26.7200000000000,2.84240000000000;12,3,26.6808000000000,2.19440000000000;12,4,26.6482000000000,1.66050000000000;12,6,26.5752000000000,0.235600000000000;12,7,26.5839000000000,0.640600000000000;12,8,26.5904000000000,0.629600000000000;12,9,26.5883000000000,0.949900000000000;12,10,26.5785000000000,0.198800000000000;12,11,26.5959000000000,0.666400000000000;12,12,26.5992000000000,0.176700000000000;12,13,26.6024000000000,0.920500000000000;12,14,26.6133000000000,0.438100000000000;12,15,26.6144000000000,0.563300000000000;12,16,26.7276000000000,3.17010000000000;12,18,26.5785000000000,0.154600000000000;12,19,26.6318000000000,0.791600000000000;12,20,26.6514000000000,1.33280000000000;12,21,26.6264000000000,1.27760000000000;12,22,26.6133000000000,0.515500000000000;12,23,26.5959000000000,0.438100000000000;12,24,26.6612000000000,1.50960000000000;12,25,26.6580000000000,1.79680000000000;12,26,26.5937000000000,0.640600000000000;12,27,26.5850000000000,-0.449200000000000;12,28,26.6514000000000,1.25920000000000;12,30,26.6460000000000,1.30340000000000;12,31,26.6307000000000,0.953600000000000;12,32,26.5861000000000,0.272500000000000;12,33,26.6307000000000,1.10090000000000;12,34,26.6166000000000,0.375500000000000;12,35,26.6286000000000,0.891000000000000;8,30,23.7863000000000,-37.9381000000000;8,31,23.3312000000000,-38.3137000000000;8,32,23.3399000000000,-38.7887000000000;8,34,23.3028000000000,-38.8181000000000;8,35,23.3028000000000,-38.4757000000000;8,36,23.2658000000000,-39.0685000000000;8,37,23.2658000000000,-38.7887000000000;8,38,23.2636000000000,-38.7923000000000;8,39,23.2277000000000,-39.0869000000000;8,40,23.1918000000000,-38.6929000000000;8,41,23.1918000000000,-39.1311000000000;8,42,23.1537000000000,-39.1311000000000;8,43,23.1515000000000,-38.9433000000000;8,44,23.1166000000000,-39.3814000000000;8,46,23.0796000000000,-39.0611000000000;8,47,23.0796000000000,-39.1274000000000;8,48,23.0426000000000,-39.5103000000000;8,49,23.0350000000000,-39.1163000000000;8,50,23.0056000000000,-39.3851000000000;8,51,22.9685000000000,-39.5729000000000;8,52,22.9685000000000,-39.2857000000000;8,53,22.9315000000000,-39.8196000000000;8,54,22.8945000000000,-39.5729000000000;8,55,22.8934000000000,-39.5729000000000;8,57,22.8204000000000,-39.9485000000000;8,58,22.8193000000000,-39.6981000000000;8,59,22.7823000000000,-39.7459000000000;9,0,22.7453000000000,-40.0736000000000;9,1,22.7453000000000,-39.6318000000000;9,2,22.7083000000000,-40.1694000000000;9,3,22.6712000000000,-40.1988000000000;9,4,22.6712000000000,-39.9485000000000;9,5,22.5972000000000,-40.4529000000000;9,6,22.5972000000000,-40.1988000000000;9,7,22.5591000000000,-40.3240000000000;9,9,22.5221000000000,-40.5781000000000;9,10,22.4872000000000,-40.1988000000000;9,11,22.4665000000000,-40.5744000000000;9,12,22.4110000000000,-40.7032000000000;9,13,22.4110000000000,-40.4529000000000;9,14,22.3740000000000,-40.7658000000000;9,15,22.3369000000000,-40.7180000000000;9,16,22.3086000000000,-40.7106000000000;9,17,22.2618000000000,-41.0788000000000;9,18,22.2291000000000,-40.8284000000000;9,19,22.1910000000000,-41.1414000000000;9,21,22.1551000000000,-41.3292000000000;9,22,22.1507000000000,-40.9536000000000;9,23,22.1137000000000,-41.4580000000000;];


%fileID = fopen('Log_2015.09.09.txt');
%formatSpec = '%d %f32 %f32 %f32 %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.3f %6.5f %6.5f %6.5f %6.5f %6.5f %6.5f %6.5f';
%N = 5 ;
%D = textscan(fileID,formatSpec,N );
%fclose(fileID);
%celldisp(D (1));

%Data=D;

%M = dlmread('Log_2015.09.09.dat');
%M(1,24)

% Data = dlmread('Log_2015.09.07-13.dat');
% Data(1,24)
% 
% %====================================================
% % Начално установяване на Прост модел
% %====================================================
% 
% % r0 = 0.074200002;
% r0_disch = 0.00088; % вътрешно съпротивление на батерията при разряд
% r0_ch = 0.0015; % вътрешно съпротивление на батерията при заряд
% 
% % r0 = 0.074200002;
% % r0 = 0.00088; % Стойност при разряд на батерии 2xGPL121000 от
% % 20140609_Discharge
% 
% %====================================================
% % Начално установяване на Усъвършенстван модел
% %====================================================
% 
% 
% %Значимите колони са 19 и 20 "(19)BSP_Ubat (20)BSP_Ibat"
% 
% %Батерийния блок е съставена от 27 броя последователно свързани батерии
% %OPzV 800, всяка по 2V.
% 
% % Константи при заряд и разряд
% 
% Kc = 1.18; % константа за lead-acid батерии
% delta = 1.2; % константа за lead-acid батерии
% eps = 1.29; % константа
% theta = 22; % температура на електролита = температура на околната среда, градуси
% theta_f = -40; % температура на замръзване на електролита, градуси (може и theta_f = -35)
% I_nom = 5.2; % номинален разряден ток на батерията, А (от datasheet)
% C0 = 85; % капацитет при 0 градуса (0,85*100Ah)
% % Коефициенти, определящи Em
% % Em0 = 12.6; % напрежение на празен ход при пълен заряд за 1 батерия, V
% Em0 = 23.79; % напрежение на празен ход при пълен заряд за 2 батерии, V
% Ke = 0.017; % константа
% % R10 = 0.023; % константа, ом
% R10 = 0.003;  % константа, определяща вътрешното съпротивление на батерията
% tau1 = 210.52; % времеконстанта на главния клон(RC звено), секунди (константа, определяща вътрешното съпротивление на батерията)
% %R20 = 0.015; % константа, ом
% % A21 = -8; % константа
% % A22 = -8.45; % константа
% % R2 = R20.*((exp(A21.*(1-SOC)))./(1+exp(A22.*(I./I_nom)))); % съпротивление в главния клон, ом
% % R00 = 0.0109; % стойност на R0 при SOC = 1, ом, емпирично установено
% R00 =  0,0000978 ; %0.0005; % Вътрешно, последователно съпротивление (спрямо datasheet) стойност на R0 при SOC = 1, ом, от спецификацията (вътрешно съпротивление)
% % A0 = 2.9895; % константа
% A0 = 3; % константа, определяща вътрешното последователно съпротивление
% 
% %====================================================
% % Прост модел
% %====================================================
% 
% Vb = Data (:,19);
% V = Data(:,19); % измерено напрежение на батерията,V
% I = Data(:,20); % измерен ток от/към бактерията, А
% 
% 
% for i = 1:length(I)
%     if I(i,1)<0
%         r0=r0_disch;
%     elseif I(i,1)>=0
%         r0=r0_ch;
%     end
%     if i == 1
%         Vb(i,1) = Vb(1,1);
%     else
%         Vb(i,1) = Vb(i-1,1) + r0*I(i-1,1);
%     end
% end
% Vb;
% % Vb = Em_r - r0*I;
% 
% t = 1:length(Data);
% % figure(1)
% % plot (t,V, t,Vb), grid on
% % xlabel('t, минути'), ylabel('Uбат, V');
% % legend('Измерена стойност', 'Пресметната стойност');
% % title ('Графика на напрежението на батерията'); % Задава заглавие на чертежното поле
% 
% %====================================================
% % Усъвършенстван модел
% %====================================================
% 
% Itotal = sum(Data(:,20)); %A
% FCC = Itotal/60; % Full charge capacity, Ah (капацитет при напълно заредена батерия)
% C_nom = 3780; % номинален капацитет на батерията, Аh (C(0,theta))
% br_minuti = numel(Data(:,2)); % брой минути
% discharge_hours = br_minuti/60; % продължителност на измерването в часове; h
% 
% Qe = zeros(br_minuti,1);
% otnet_zarqd = zeros(length(Data(:,4)),1);
% SOC = zeros(length(Data(:,4)),1);
% DOC = zeros(length(Data(:,4)),1);
% C_1_minute = zeros(br_minuti,1);
% 
% Qe(1,1) = Data(1,4);
% %====================================================
% for k = 1:length(Data(:,4))
%     otnet_zarqd(k,1) = sum(Data(1:k,20))/60; % Пресмятане на отнетия заряд от батерията при разряд, Ah %%%Data(k,20)/60; %
%     SOC(k,1) = (1 + (otnet_zarqd(k,1)/C_nom)); % Пресмятане на SOC, %
%     C_1_minute(k,1) = I(k,1)*1/60; % капацитет на батерията във всяка минута, Ah
%     DOC(k,1) = (1 - (otnet_zarqd(k,1)/FCC)); % Пресмятане на DOC, %
% end
% %====================================================
% % Пресмятане на R0 и R1
% R0 = R00.*(1+A0.*(1-SOC)); % съпротивление на изводите, ом
% R1 = -R10.*log(DOC); % съпротивление на главния клон, ом
% % R1 = (0.0489*exp(-0.147*I)) + 0.0171*SOC - 0.00275;
% C1 = tau1./R1; % капацитет в главния клон, фаради
% 
% for k = 2:length(Data(:,20))
%     Qe(k,1) = Qe(k-1,1) + Data(k,20); % Пресмятане на Qe, % Отнет заряд, ампер за минута
% end
% 
% %====================================================
% 
% C_total = ((Kc*C_nom)*((1-theta/theta_f)^eps))./(1+(Kc-1).*(I./I_nom).^delta);
% 
% % r0 = 0.53077; % вътрешно съпротивление при напълно заредена батерия, ом; може да има стойност 0,05377
% 
% %====================================================
% 
% % Електродвижещо напрежение- да проверим името му и да напишем
% Em = Em0 - Ke*(273+theta).*(1-SOC);
% 
% %====================================================
% % DOC = (1  - (Qe./(C_total.*2.6))) ; % проценти
% %====================================================
% 
% %====================================================
% % Пресмятане на вътрешното съпротивление на батерията
% 
% % r = R0 + R1;
% 
% %s = 1-exp(-10/tau1);
% s = 1-exp(-t/tau1);
% s1 = zeros(length(s),1);
% for i = 1:length(s)
%     s1(i,1) = s(1,i);
% end
% r_RC_blok = R1.*s1;
% 
% r = R0 - r_RC_blok; % сума от 1 съпротивление, последователно свързано на R-C блок
% %====================================================
% %  Работи
% 
% % Rbattery = 8.4*R00 + 2.58*R10;
% % Vmodel2 = Em - I.*Rbattery;
% 
% % Vmodel = Em + I.*r;
% %
% % figure(2)
% % plot (t,V, t,Vmodel), grid on
% % legend('Измерена стойност', 'Пресметната стойност');
% 
% Umodel=zeros(length(Data),1);
% Umodel(1,1)=Data(1,20);
% 
% % for k = 2:length(Data)
% %     Umodel(k,1) = V(k-1,1) - I(k,1)*r(k,1);
% % end
% 
% 
% for k = 1:length(Data)
%     if k==1
%         Umodel(k,1) = V(k,1);
%     else
%         Umodel(k,1) = Umodel(k-1,1) - I(k,1)*r(k,1);
%     end
% end
% 
% Pmodel= Umodel.*I;
% Pmeasered= V.*I;
% 
% 
% % figure(3)
% % plot (t,V,'--',t,Umodel,'-.','LineWidth',2), grid %on
% % %plot (t,V, t,Vb,'--',t,[0;Umodel(3:(length(Umodel)));0],'-.','LineWidth',2), grid %on
% % % plot (t,V, t,Vb,'--',t,Umodel(0:(length(Umodel)-1),1),'-.','LineWidth',2), grid %on
% % %plot (t,V, t,[0;Vb(2:(length(Vb)),1)],'--',t,Umodel,'-.','LineWidth',2), grid %on
% % %plot (t,V, t,Vb,'--',t,Umodel,'-.'), grid on
% % xlabel('Time, minutes'), ylabel('Ubat, V');
% % legend('Measured value',  'Calculated value using the advanced model');
% % %title ('Discarge voltage grapf'); 
% % axis([0 200 53 57])
% % 
% % figure(8)
% % plot (t,I,'LineWidth',2), grid %on
% % xlabel('Time, minutes'), ylabel('I');
% % legend(', %');
% % %title ('Calculated voltage deviation grapf'); 
% % axis([0 200 -40 0])
% 
% 
% 
% 
% % figure(4)
% % plot (t,[V-Umodel],'LineWidth',2), grid %on
% % xlabel('Time, minutes'), ylabel('Ubat, V');
% % legend('Difference between the measured value and calculated value');
% % %title ('Calculated voltage deviation grapf'); % Задава заглавие на чертежното поле
% 
% 
% %figure(6)
% % subplot (2,1,1); plot (t,D(:,6).*D(:,7),   t,D(:,9).*D(:,10) , t,D(:,11)*1000      ) , xlabel(time_label), ylabel('P, W'); grid; 
% % legend ( 'Мощност от/към батерията Pбат, W', 'Мощност от генератора Pген, W', 'Мощност на товара Pтов, W')
% % title ('{\bf\it STATUS PV  } \copyright 2003-2010'); % Задава заглавие на чертежното поле
% 
% 
% %subplot (3,1,1)
% %figure(1)
% %plot (t,V, t,Umodel,'-.','LineWidth',2), grid %on
% %xlabel('Time, minutes'), ylabel('Ubat, V');
% %legend('Measured value', 'Calculated value with the advanced model');
% %title ('Battery voltage graph'); % Задава заглавие на чертежното поле
% 
% %subplot (3,1,2)
% % figure(2)
% % plot (t,Pmeasered, t,Pmodel,'-.','LineWidth',2), grid %on
% % xlabel('Time, minutes'), ylabel('Pbat, W');
% % legend('Measured battery power, W', 'Calculated battery power, W');
% % %title ('Power supplied by/to the battery graph'); % Задава заглавие на чертежното поле
% 
% %subplot (3,1,3)
% %plot (t,[V-Umodel],'LineWidth',2), grid %on
% %xlabel('Time, minutes'), ylabel('Ubat, V');
% %legend('Difference between the measured and the calulated value with the advanced model');
% %title ('Difference between the measured and calculated voltage graph'); % Задава заглавие на чертежното поле
% 
% 
% abs_model_1 = zeros(length(Data),1);
% rel_abs_model_1 = zeros(length(Data),1);
% abs_model_2 = zeros(length(Data),1);
% rel_abs_model_2 = zeros(length(Data),1);
% 
% for i = 1:length(Data)
%     
%     abs_model_1(i,1) = abs(Data(i,3))-abs(Vb(i,1));
%     rel_abs_model_1(i,1) = ((abs(Data(i,3))-abs(Vb(i,1)))/Data(i,3))*100;
%     
%     abs_model_2(i,1) = abs(Data(i,3))-abs(Umodel(i,1));
%     rel_abs_model_2(i,1) = ((abs(Data(i,3))-abs(Umodel(i,1)))/Data(i,3))*100;
%     
% end
% 
% int_model_1 = (sum(V) - sum(Vb(:,1)));
% rel_int_model_1 = (sum(V) - sum(Vb(:,1)))./(sum(V))*100;
% 
% int_model_2 = (sum(Data((1:48),3)) - sum(Umodel((1:48),1)));
% rel_int_model_2 = (sum(Data((1:48),3)) - sum(Umodel((1:48),1)))./(sum(Data((1:48),3)))*100;




%=====================================================
% ПРЕСМЯТАНЕ С РЕГРЕСИОННО МОДЕЛИРАНЕ

myfile = fullfile('C:\Полигона\Докторантура\Статия модел батерия','battery2019.mat');       
matObj = matfile(myfile,'Writable',true);



time=0;

period_time = 230*24*60;
for i = 1 :  period_time %size(matObj.Ibat) % цялостен период - период за трениране + прогнозен период
    
time(i,1) = i;

end

nm=1; %начален момент на гр
krm=period_time;%size(matObj.Ibat); %краен момент на гр

C_nom = 800*27; %C_nom = 3780;
max_time=size(matObj.Ibat)
training_time = 50*24*60;  % време за трениране на модела, изчисляване на б1 и б2
Vbattery_regres = zeros (period_time,1);
Vbattery_difference = zeros (period_time,1);
%otnet_zarqd = zeros(max_time,1);

I_training = zeros (training_time,1);
I_pv_training = zeros (training_time,1);
SOC_training = zeros (training_time,1);
Vbattery_training = zeros (training_time,1);
Ptow_training = zeros (training_time,1);

%SOC(1,1)=0.75

%  for i=1:period_time
%      
%      otnet_zarqd(i,1) = sum(matObj.Ibat_BSP(1:i,1))/60;%otnet_zarqd(i,1) = sum(matObj.Ibat(1:i,1))/60; % Пресмятане на отнетия заряд от батерията при разряд, Ah %%%Data(k,20)/60; %
%      SOC(i,1) = (1 + (otnet_zarqd(i,1)/C_nom)); %SOC(i,1) = (1 + (otnet_zarqd(i,1)/C_nom)); % Пресмятане на SOC, %
%      
%  end
 
 
     for i=1:training_time
        
%      I_training(i,1)= I(i,1);
%      SOC_training(i,1)= SOC(i,1);     
%      Vbattery_training(i,1) = V(i,1);
     
     I_training(i,1) = matObj.Ibat_BSP(i,1);  %matObj.Ibat(i,1);
     I_pv_training(i,1) = matObj.Ibat_PV(i,1);
     %SOC_training(i,1) = matObj.SOC(i,1)/100; 
     SOC_training(i,1) = SOC(i,1);   %matObj.SOC(i,1);  
     Vbattery_training(i,1) = matObj.Vbat(i,1);
     Ptow_training(i,1) = matObj.Ptow(i,1);
     end


 X = [I_training I_pv_training SOC_training Ptow_training];
 b = regress(Vbattery_training,X);
 
b
 
       for i=training_time:period_time;
        
      Vbattery_regres(i,1) =  matObj.Ibat_BSP(i,1)*b(1,1) + matObj.Ibat_PV(i,1)*b(2,1) + SOC(i,1)*b(3,1) + matObj.Ptow(i,1)*b(4,1); % matObj.SOC(i,1)*b(2,1)/100; b = 0.1006 56.1657 
      %Vbattery_regres(i,1) =  matObj.Ibat(i,1)*0.1244 + SOC(i,1)*85.7369 + matObj.Ptow(i,1)*(-0.0014); % matObj.SOC(i,1)*b(2,1)/100; b = 0.1006 56.1657 
   
      %Vbattery_regres(i,1)=  matObj.Ibat(i,1)* 0.1563 + SOC(i,1)*65.3803;
      Vbattery_difference(i,1) = Vbattery_regres(i,1) - matObj.Vbat(i,1);
         
        end 

figure(4)
subplot (3,1,1);plot (time,matObj.Ibat(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat, V');
legend('Measured current');
title ('Voltage grapf'); 
      
subplot (3,1,2);plot (time,matObj.SOC(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat, V');
legend('Measured SOC');
title ('Current grapf');
axis([0 9000 0 110])

subplot (3,1,3);plot (time,SOC(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat, V');
legend('Calculated SOC');
title ('Current grapf');
axis([0 9000 0 1.50])

figure(5)
plot (time,matObj.Vbat(nm:krm,1),'--',time,Vbattery_regres(nm:krm,1),'-.',time,Vbattery_difference(nm:krm,1) ,'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ubat, V');
legend('Measured value',  'Calculated value using the advanced model','Difference');
title ('Voltage grapf'); 
%axis([0 10000 -10 70])
        
figure(9)
subplot (3,1,1); %plot (time,V(nm:krm,1),'--','LineWidth',2), grid %on
plot (time,matObj.Vbat(nm:krm,1),'--','LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ubat, V');
legend('Measured value',  'Calculated value using the advanced model','Difference');
title ('Voltage grapf'); 
%axis([0 10000 -10 70])
  
subplot (3,1,2);plot (time,matObj.Ibat(nm:krm,1),'--','LineWidth',2), grid %on
%plot (time,I(nm:krm,1),'--','LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat, V');
legend('Measured value',  'Calculated value using the advanced model','Difference');
title ('Current grapf'); 

subplot (3,1,3);plot (time,matObj.Vbat(nm:krm,1),'--',time,Vbattery_regres(nm:krm,1),'-.',time,Vbattery_difference(nm:krm,1) ,'LineWidth',2), grid %on
%plot (time,V(nm:krm,1),'--',time,Vbattery_regres(nm:krm,1),'-.',time,Vbattery_difference(nm:krm,1) ,'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ubat, V');
legend('Measured value',  'Calculated value using the advanced model','Difference');
title ('Voltage grapf'); 




figure(10)
subplot (2,1,1);plot (time,matObj.Vbat(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ubat, V');
legend('Measured voltage');
title ('Voltage grapf'); 
      
subplot (2,1,2);plot (time,matObj.Ibat(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat, V');
legend('Measured current');
title ('Current grapf');


% figure(11)
% plot (time,matObj.SOC(nm:krm,1)/100,'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('Ubat, V');
% legend('Measured SOC');
% title ('SOC grapf'); 
% axis([2000 4000 0 1.10])

% figure(12)
% plot (time,SOC(nm:krm,1),'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('Ubat, V');
% legend('Calculated SOC');
% title ('SOC grapf'); 
% axis([2000 4000 0 1.10])

% figure(13)
% plot (time,matObj.Vbat(nm:krm,1),'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('Ubat, V');
% legend('Measured Voltage');
% title ('Voltage grapf'); 

figure(14)
plot (time,matObj.Ibat(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Current, V');
legend('Current Voltage');
title ('Current grapf'); 
axis([2000 4000 -80 80])

figure(15)
plot (time,matObj.Ibat_BSP(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat_BSP, A');
legend('Ibat_BSP');
title ('Ibat_BSP'); 

figure(15)
plot (time,matObj.Ibat_PV(nm:krm,1),'LineWidth',2), grid %on
xlabel('Time, minutes'), ylabel('Ibat_PV, A');
legend('Ibat_PV');
title ('Ibat_PV'); 

%====================================================

% ПРЕСМЯТАНЕ НА ГРЕШКИТЕ НА МОДЕЛИТЕ
% Усъвършенстван модел

%L = length(Data)% грешката за 1 седмица

% MAE = zeros(L,1);  % СРЕДНА АБСОЛЮТНА ГРЕШКА - MEAN ABSOLUTE ERROR
% MAPE = zeros(L,1); % СРЕДНА АБСОЛЮТНА ПРОЦЕНТНА ГРЕШКА - MEAN ABSOLUTE PENCENTAGE ERROR
MSE_Vbattery_regres = zeros(size(matObj.Ibat),1); % MEAN SQUARED ERROR

Periods=0;

for i = training_time:period_time  % пропускат се първите дни на трениране на модела
  

      MSE_Vbattery_regres(i,1) = Vbattery_difference(i,1)^2 ; 
   
    if MSE_Vbattery_regres(i,1) > 0 
        
        Periods=Periods+1;
    end    
        
end

SUM_MSE_Vbattery_regres=0;

for i = training_time:period_time  % пропускат се първите дни на трениране на модела
    
     SUM_MSE_Vbattery_regres = MSE_Vbattery_regres(i,1) + SUM_MSE_Vbattery_regres;
     
end

SUM_MSE_Vbattery_regres_total = SUM_MSE_Vbattery_regres/Periods

% for i = 2:L
%     
%    MAE(i,1) =  abs ( Umodel (i,1) - V (i,1) );
%     
% end
% 
% M=max(MAE);
% SUM=0;
% 
% for i = 1:L
%     
%    SUM =  MAE(i,1) + SUM;
%     
% end
% 
% SUM = SUM/L
% 
% 
% MAPE(1,1) =  abs ( Umodel (1,1) - V (1,1));
% MAPE(2,1) =  abs ( Umodel (2,1) - V (2,1));
% for i = 2:L
%     
%    MAPE(i,1) =  abs ( (Umodel (i,1) - V (i,1))/ V (i,1) );
%   %  MAPE(i,1) =   ( (Umodel (i,1) - V (i,1))/ V (i,1) );
%     MAPE_P(i,1) =   ( (Pmodel (i,1) - Pmeasered (i,1))/ Pmeasered (i,1) ); 
% end
% 
% M=max(MAPE);
% SUM1=0;
% 
% for i = 1:L
%     
%    SUM1 =  MAPE(i,1) + SUM1;
%     
% end
% 
% SUM1 = SUM1/L*100






% figure(5)
% plot (t,MAPE_P*100,'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('Pbat, %');
% legend('Difference between measured and calculated battery power, %');
% %title ('Calculated voltage deviation grapf'); % Задава заглавие на
% %чертежното поле
% 
% figure(6)
% plot (t,MAPE*100,'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('Pbat, %');
% legend('Difference between measured and calculated battery voltage, %');
% %title ('Calculated voltage deviation grapf'); % Задава заглавие на
% %чертежното поле

% figure(7)
% plot (t,r_RC_blok,'LineWidth',2), grid %on
% xlabel('Time, minutes'), ylabel('r_RC_blok');
% legend(', %');
% %title ('Calculated voltage deviation grapf'); % Задава заглавие на
% %чертежното поле
